Revit 2026 API

# MacroModuleIterator Class

---

An iterator to the Macros in a MacroModule.

SystemObject Autodesk.Revit.DB.MacrosMacroModuleIterator

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MacroModuleIterator : IEnumerator<Macro>
```
```vb
Public Class MacroModuleIterator
	Implements IEnumerator(Of Macro)
```
```cpp
public ref class MacroModuleIterator : IEnumerator<Macro^>
```
```fsharp
type MacroModuleIterator =
    class
        interface IEnumerator<Macro>
    end
```

The MacroModuleIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the MacroModuleIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrent | Returns the current Macro. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Macros Namespace